burakenez/gd32e502-demo-suites-cmake-vscode/Drivers/GD32E502_standard_peripheral/Include/gd32e502_gpio.h
/* GPIO output max speed value */
#define OSPD_OSPD0(regval)         (BITS(0, 1) & ((uint32_t)(regval) << 0))
#define GPIO_OSPEED_2MHZ           OSPD_OSPD0(0)                   /*!< output max speed 2MHz */
#define GPIO_OSPEED_10MHZ          OSPD_OSPD0(1)                   /*!< output max speed 10MHz */
#define GPIO_OSPEED_50MHZ          OSPD_OSPD0(3)                   /*!< output max speed 50MHz */

/* GPIO alternate function values */
#define GPIO_AFR_SET(n, af)        ((uint32_t)((uint32_t)(af) << (4U * (n))))
#define GPIO_AFR_MASK(n)           ((uint32_t)((uint32_t)(0xFU) << (4U * (n))))
 
/* GPIO alternate function */
#define AF(regval)                 (BITS(0, 3) & ((uint32_t)(regval) << 0)) 
#define GPIO_AF_0                  AF(0)                           /*!< alternate function 0 selected */
#define GPIO_AF_1                  AF(1)                           /*!< alternate function 1 selected */
#define GPIO_AF_2                  AF(2)                           /*!< alternate function 2 selected */
#define GPIO_AF_3                  AF(3)                           /*!< alternate function 3 selected */
#define GPIO_AF_4                  AF(4)                           /*!< alternate function 4 selected */
#define GPIO_AF_5                  AF(5)                           /*!< alternate function 5 selected */
#define GPIO_AF_6                  AF(6)                           /*!< alternate function 6 selected */
#define GPIO_AF_7                  AF(7)                           /*!< alternate function 7 selected */
#define GPIO_AF_8                  AF(8)                           /*!< alternate function 8 selected */
#define GPIO_AF_9                  AF(9)                           /*!< alternate function 9 selected */

/* function declarations */
/* reset GPIO port */
void gpio_deinit(uint32_t gpio_periph);
/* set GPIO mode */
void gpio_mode_set(uint32_t gpio_periph, uint32_t mode, uint32_t pull_up_down, uint32_t pin);
/* set GPIO output type and speed */
void gpio_output_options_set(uint32_t gpio_periph, uint8_t otype, uint32_t speed, uint32_t pin);

/* set GPIO pin bit */
void gpio_bit_set(uint32_t gpio_periph, uint32_t pin);
/* reset GPIO pin bit */
void gpio_bit_reset(uint32_t gpio_periph, uint32_t pin);
/* write data to the specified GPIO pin */
void gpio_bit_write(uint32_t gpio_periph, uint32_t pin, bit_status bit_value);
/* write data to the specified GPIO port */
void gpio_port_write(uint32_t gpio_periph, uint16_t data);

/* get GPIO pin input status */
FlagStatus gpio_input_bit_get(uint32_t gpio_periph, uint32_t pin);
/* get GPIO port input status */
uint16_t gpio_input_port_get(uint32_t gpio_periph);
/* get GPIO pin output status */
FlagStatus gpio_output_bit_get(uint32_t gpio_periph, uint32_t pin);
/* get GPIO port output status */
uint16_t gpio_output_port_get(uint32_t gpio_periph);

/* set GPIO alternate function */
void gpio_af_set(uint32_t gpio_periph, uint32_t alt_func_num, uint32_t pin);
/* lock GPIO pin bit */
void gpio_pin_lock(uint32_t gpio_periph, uint32_t pin);

/* toggle GPIO pin status */
void gpio_bit_toggle(uint32_t gpio_periph, uint32_t pin);
/* toggle GPIO port status */
void gpio_port_toggle(uint32_t gpio_periph);

#endif /* GD32E502_GPIO_H */
